<?

header ("Content-Type:text/xml");

echo '<?xml version="1.0" encoding="UTF-8"?>
';?>
<КоммерческаяИнформация ВерсияСхемы="2.03" ДатаФормирования="<? echo date('Y-m-d');?>">
<?

$select = Array();
$select[0]='На Согласовании';
$select[1]='К отгрузке';
$test = get_param('test');

if($test==1){
	$orders = $q->select("select * from ".$prefix."orders  order by id desc limit 4 ");
}else{
		$orders = $q->select("select * from ".$prefix."orders where 1c_export!=2 order by id desc ");
}

foreach($orders as $o){
	$q->exec("update ".$prefix."orders set 1c_export=1 where id=".to_sql($o['id']));
	$date = date('Y-m-d',to_phpdate($o['changed'])+7200);
	$time = date('H:i:s',to_phpdate($o['changed'])+7200);
	$full = $q->select("select * from ".$prefix."orders_full where order_id = ".to_sql($o['id']));
	$sum = 0;
	
	foreach($full as $f){
		$sum += $f['price']*$f['col'];
	}
	
	//for($nn=strlen($o['id']);$nn<12;$nn++)$o['id'] = '0'.$o['id'];
?>
	<Документ>
		<Ид><?=$o['id'];?></Ид>
		<Номер><?=$o['id'];?></Номер>
		<Дата><?=$date;?></Дата>
		<ХозОперация>Заказ товара</ХозОперация>
		<Роль>Продавец</Роль>
		<Валюта>руб</Валюта>
		<Курс>1</Курс>
		<Сумма><?=$sum+$o['delivery_price'];?></Сумма>
		<Контрагенты>
			<Контрагент>
				<Ид><?=$o['id'];?></Ид>
				<Наименование><?=$o['fio'];?></Наименование>
				<Роль>Покупатель</Роль>
				<ПолноеНаименование><?=$o['fio'];?></ПолноеНаименование>
				<Фамилия><?=$o['fio'];?></Фамилия>
				<Имя></Имя>
                <ИНН><?=$o['id'];?></ИНН>
				<АдресРегистрации>
					<Представление><?=$o['adres'];?>, тел <?=$o['phone'];?>, email <?=$o['email'];?>,
                    <?=$o['delivery'];?>,
<?=$o['pay'];?>,
                    <?=$o['comm'];?>
                    </Представление>
					
				</АдресРегистрации>

			</Контрагент>
		</Контрагенты>
		<Время><?=$time;?></Время>
		<Комментарий/>
		<Товары>
        <?
        if($o['delivery_price'] > 0){
		?>
			<Товар>
				<Ид>ORDER_DELIVERY</Ид>
				<Наименование>Доставка заказа</Наименование>
				<БазоваяЕдиница Код="796" НаименованиеПолное="Штука" МеждународноеСокращение="PCE">шт</БазоваяЕдиница>
				<ЦенаЗаЕдиницу><?=$o['delivery_price'];	?></ЦенаЗаЕдиницу>
				<Количество>1</Количество>
				<Сумма><?=$o['delivery_price'];	?></Сумма>
				<ЗначенияРеквизитов>
					<ЗначениеРеквизита>
						<Наименование>ВидНоменклатуры</Наименование>
						<Значение>Услуга</Значение>
					</ЗначениеРеквизита>
					<ЗначениеРеквизита>
						<Наименование>ТипНоменклатуры</Наименование>
						<Значение>Услуга</Значение>
					</ЗначениеРеквизита>
				</ЗначенияРеквизитов>
			</Товар>
           <?
		}
		   ?>
            <?
			foreach($full as $f){
				if($f['param'] == 0){
					$good = $q->select1("select * from ".$prefix."goods where id=".to_sql($f['good_id']));
				}else{
					$good = $q->select1("select * from ".$prefix."goods_price where id=".to_sql($f['param']));
				}
			?>
			<Товар>
				<Ид><?=$good['1cid'];?></Ид>
				<Наименование><?=$good['name'];?></Наименование>
				<БазоваяЕдиница Код="018" НаименованиеПолное="Погонный метр" МеждународноеСокращение="">пог.м</БазоваяЕдиница>
				<ЦенаЗаЕдиницу><?=$f['price'];?></ЦенаЗаЕдиницу>
				<Количество><?=$f['col'];?></Количество>
				<Сумма><?=$f['col']*$f['price'];?></Сумма>
				<ЗначенияРеквизитов>
					<ЗначениеРеквизита>
						<Наименование>ВидНоменклатуры</Наименование>
						<Значение>Ткань</Значение>
					</ЗначениеРеквизита>
					<ЗначениеРеквизита>
						<Наименование>ТипНоменклатуры</Наименование>
						<Значение>Товар</Значение>
					</ЗначениеРеквизита>
				</ЗначенияРеквизитов>
			</Товар>
            <?
            }
			?>
		</Товары>
		<ЗначенияРеквизитов>
			<ЗначениеРеквизита>
				<Наименование>Метод оплаты</Наименование>
				<Значение>Безналичный расчет</Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Заказ оплачен</Наименование>
				<Значение>true</Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Доставка разрешена</Наименование>
				<Значение>true</Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Отменен</Наименование>
				<Значение>false</Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Финальный статус</Наименование>
				<Значение>true</Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Статус заказа</Наименование>
				<Значение><?=$select[$o['order_status']];?></Значение>
			</ЗначениеРеквизита>
			<ЗначениеРеквизита>
				<Наименование>Дата изменения статуса</Наименование>
				<Значение><?=$date;?> <?=$time;?></Значение>
			</ЗначениеРеквизита>
		</ЗначенияРеквизитов>
	</Документ>
<?
}
?>    
</КоммерческаяИнформация>